org/the_pyschology_of_money.org
:PROPERTIES:
:ID:       98a4affb-34a7-46fe-923d-b19c88c85309
:END:
#+title: The Pyschology of Money

* Meta
- author :: Morgan Housel

Finance is overwhelmingly taught as a math-based field, but it can also be understood from the lenses of psychology and history.

Your experiences with money shape how you think the world works, but it only makes up a minute amount of what's happened in the world. Equally intelligent people can disagree on how they should spend or invest their money, because everyone's experience with money is different.

* It Is Never as Good or as Bad as it Seems
